# GetAirSystemData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalSystem..::..GetAirSystemData Method
MEPAnalyticalSystem Class See Also
---
Returns the air system data, null if not available.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public AirSystemData GetAirSystemData()
```

Visual Basic
---
```text
Public Function GetAirSystemData As AirSystemData
```

Visual C++
---
```text
public:
AirSystemData^ GetAirSystemData()
```

# See Also
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace